In [2]:
import pandas as pd
from env import get_db_url

# Acquire:

I need to figure out why these are coming out differently after the join. 
- There's a difference of 52,887 records.
    - It looks like the difference here is due to having 52,893 null values in logs.cohort_id, as well as 6 nulls in 
- it appears that there there are some IDs and Cohort IDs that do not much.

### Importing from CSV:

In [93]:
df1 = pd.read_csv('anonymized_curriculum_access.csv', sep = ' ')

In [94]:
df1.shape[0]

900223

In [95]:
df1

,date,time,path,user_id,cohort_id,ip
0,2018-01-26,09:55:03,/,1.0,8.0,97.105.19.61
1,2018-01-26,09:56:02,java-ii,1.0,8.0,97.105.19.61
2,2018-01-26,09:56:05,java-ii/object-oriented-programming,1.0,8.0,97.105.19.61
3,2018-01-26,09:56:06,slides/object_oriented_programming,1.0,8.0,97.105.19.61
4,2018-01-26,09:56:24,javascript-i/conditionals,2.0,22.0,97.105.19.61
...,...,...,...,...,...,...
900218,2021-04-21,16:41:51,jquery/personal-site,64.0,28.0,71.150.217.33
900219,2021-04-21,16:42:02,jquery/mapbox-api,64.0,28.0,71.150.217.33
900220,2021-04-21,16:42:09,jquery/ajax/weather-map,64.0,28.0,71.150.217.33
900221,2021-04-21,16:44:37,anomaly-detection/discrete-probabilistic-methods,744.0,28.0,24.160.137.86
900222,2021-04-21,16:44:39,jquery/mapbox-api,64.0,28.0,71.150.217.33

## Importing from the database using SQL

### Using Default Join:

In [106]:
url = get_db_url('curriculum_logs')

query = '''SELECT * FROM logs
JOIN cohorts 
ON logs.cohort_id = cohorts.id;'''

In [ ]:
df2 = pd.read_sql(query, url)

In [ ]:
df2.shape[0]

In [ ]:
df2.isnull().sum()

### Using Right Join:

In [96]:
url = get_db_url('curriculum_logs')

query = '''SELECT * FROM logs
RIGHT JOIN cohorts 
ON logs.cohort_id = cohorts.id;'''

In [97]:
df3 = pd.read_sql(query, url)

In [60]:
df3.shape[0]

847336

In [88]:
df3.isnull().sum()

date               6
time               6
path               7
user_id            6
cohort_id          6
ip                 6
id                 0
name               0
slack              0
start_date         0
end_date           0
created_at         0
updated_at         0
deleted_at    847336
program_id         0
dtype: int64

In [91]:
df3[df3.cohort_id.isnull()]

,date,time,path,user_id,cohort_id,ip,id,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
3038,None,None,None,NaN,NaN,None,30,Ada,#ada,2019-02-04,2019-06-16,2019-02-04 20:13:32,2019-02-04 20:13:32,None,3
3039,None,None,None,NaN,NaN,None,60,Io,#io,2020-07-20,2021-01-21,2020-07-20 13:24:55,2020-09-30 15:54:53,None,2
164848,None,None,None,NaN,NaN,None,136,Placeholder for students in transition,#null,2021-03-03,2029-03-01,2021-03-03 21:50:49,2021-03-03 21:52:56,None,2
164854,None,None,None,NaN,NaN,None,20,Redwood,#redwood,2017-07-31,2017-12-06,2017-07-31 19:34:11,2017-08-08 21:59:33,None,2
436200,None,None,None,NaN,NaN,None,3,Carlsbad,#carlsbad,2014-09-04,2014-11-05,2016-06-14 19:52:26,2016-06-14 19:52:26,None,1
507978,None,None,None,NaN,NaN,None,10,Balboa,#balboa,2015-11-03,2016-03-11,2016-06-14 19:52:26,2016-06-14 19:52:26,None,4

### Using Left Join:

In [102]:
url = get_db_url('curriculum_logs')

query = '''SELECT * FROM logs
RIGHT JOIN cohorts 
ON logs.cohort_id = cohorts.id;'''

In [103]:
df4 = pd.read_sql(query, url)

In [104]:
df4.shape[0]

847336

In [105]:
df4.isnull().sum()

date               6
time               6
path               7
user_id            6
cohort_id          6
ip                 6
id                 0
name               0
slack              0
start_date         0
end_date           0
created_at         0
updated_at         0
deleted_at    847336
program_id         0
dtype: int64

## Trying to understand difference in counts:

In [61]:
df2.shape[0] - df3.shape[0]

52887

In [80]:
df2.isnull().sum()

date               0
time               0
path               1
user_id            0
cohort_id      52893
ip                 0
id             52893
name           52893
slack          52893
start_date     52893
end_date       52893
created_at     52893
updated_at     52893
deleted_at    900223
program_id     52893
dtype: int64

In [82]:
df2[df2.cohort_id.isnull()]

,date,time,path,user_id,cohort_id,ip,id,name,slack,start_date,end_date,created_at,updated_at,deleted_at,program_id
411,2018-01-26,16:46:16,/,48,NaN,97.105.19.61,NaN,None,None,None,None,None,None,None,NaN
412,2018-01-26,16:46:24,spring/extra-features/form-validation,48,NaN,97.105.19.61,NaN,None,None,None,None,None,None,None,NaN
425,2018-01-26,17:54:24,/,48,NaN,97.105.19.61,NaN,None,None,None,None,None,None,None,NaN
435,2018-01-26,18:32:03,/,48,NaN,97.105.19.61,NaN,None,None,None,None,None,None,None,NaN
436,2018-01-26,18:32:17,mysql/relationships/joins,48,NaN,97.105.19.61,NaN,None,None,None,None,None,None,None,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
899897,2021-04-21,12:49:00,javascript-ii,717,NaN,136.50.102.126,NaN,None,None,None,None,None,None,None,NaN
899898,2021-04-21,12:49:02,javascript-ii/es6,717,NaN,136.50.102.126,NaN,None,None,None,None,None,None,None,NaN
899899,2021-04-21,12:51:27,javascript-ii/map-filter-reduce,717,NaN,136.50.102.126,NaN,None,None,None,None,None,None,None,NaN
899900,2021-04-21,12:52:37,javascript-ii/promises,717,NaN,136.50.102.126,NaN,None,None,None,None,None,None,None,NaN
899902,2021-04-21,12:56:26,javascript-ii/RESTful-api,717,NaN,136.50.102.126,NaN,None,None,None,None,None,None,None,NaN